[
  {
    "title": "They met while pregnant but their babies never came home - maternity failings at NHS trust",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/ckg2n644l44o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 06:00:20 GMT",
    "compressed_text": "As a neonatal nursery nurse who had worked at the Princess Royal, she says \"it was really obvious to me that something wasn't right\". On each occasion, she was attached to a CTG machine which monitors a baby's heart rate, and Beth says she was assured her baby was fine and told to go home."
  },
  {
    "title": "Starmer tells Sir Jim Ratcliffe to apologise for saying UK 'colonised by immigrants'",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/ckglv1n4dzeo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 04:12:29 GMT",
    "compressed_text": "He added: \"But you've got all the same issues with the country. If you really want to deal with the major issues of immigration, with people opting to take benefits rather than working for a living, if you want to deal with that, then you're going to have to do some things which are unpopular, and show some courage.\""
  },
  {
    "title": "UK economy grew by 'subdued' 0.1% at end of 2025",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c4gjmm7dlggo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:57:26 GMT",
    "compressed_text": "\"Increases to the minimum wage have meant that we've not been able to employ the youngsters into the business - they're too expensive to have just as an extra pair of hands,\" he said. \"And we have had to refrain from taking any apprentices.\""
  },
  {
    "title": "Snow and ice warnings issued for UK after relentless rain",
    "source": "BBC News",
    "link": "https://www.bbc.com/weather/articles/cy9gje95w5zo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 05:22:15 GMT",
    "compressed_text": "After relentless wet and gloomy conditions, wintry weather is set to return to parts of the UK with snow and ice in the forecast for many. Arctic air will accompany the change in conditions, dropping temperatures as many as six degrees below average. The Met Office has issued yellow warnings for snow and ice across Scotland and northern England from 16:00 GMT Thursday to 12:00 Friday. Rain will fall as snow initially over higher ground before reaching to lower levels through Thursday night. Sett"
  },
  {
    "title": "Katie Holmes leads tributes to Dawson's Creek star James Van Der Beek",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cewz2yr47dvo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:02:30 GMT",
    "compressed_text": "Katie Holmes pays tribute to her late co-star's \"bravery, compassion, selflessness and strength\"."
  },
  {
    "title": "Kim Jong Un chooses teen daughter as heir, says Seoul",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cn0e1g7kwglo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 10:01:45 GMT",
    "compressed_text": "\"As Kim Ju Ae has shown her presence at various events, including the founding anniversary of the Korean People's Army and her visit to the Kumsusan Palace of the Sun, and signs have been detected of her voicing her opinion on certain state policies, the NIS believes she has now entered the stage of being designated as successor,\" Lee said."
  },
  {
    "title": "Sex offenders should tell police about pregnancies, review finds",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cd9gn7x8v08o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:54:21 GMT",
    "compressed_text": "There is no legal duty for a woman to disclose her pregnancy. The report suggested social services would have had an earlier opportunity to intervene had Gordon, a registered sex offender, been required to share details of his partner's pregnancy with the authorities."
  },
  {
    "title": "Sarah Ferguson asked Epstein for bankruptcy advice while he was in jail, emails suggest",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cy8ln9jj92yo?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 21:23:47 GMT",
    "compressed_text": "One proposal apparently put forward by Stern would see a chief executive hired to run Ferguson's business affairs. She would be paid a $200,000 salary, and any spending over $1,000 would need to be signed off by Epstein. He says they would need to own at least 30% of the business to be \"remotely worthwhile\"."
  },
  {
    "title": "Police identify 18-year-old as suspect in Tumbler Ridge shooting",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/ce8w95knp55o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:11:04 GMT",
    "compressed_text": "How a Reddit tipster cracked the Brown University shooting case\n\n\"He blew this case right open,\" one official said after the suspect was found dead on Thursday. \"When you crack it, you crack it.\""
  },
  {
    "title": "Boy, 13, charged after two boys stabbed in school",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cd6zq1xqndlo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:52:54 GMT",
    "compressed_text": "The Metropolitan Police said the teenager, who cannot be named for legal reasons, has also been charged with possession of a knife on school grounds and spraying an insect spray in the face of a third child."
  },
  {
    "title": "Organised crime gangs target Scottish chip shops for used cooking oil",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cy03lnnr2kpo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 06:01:49 GMT",
    "compressed_text": "\"There is the inconvenience, there is the potential damage caused by the individuals who are entering premises or outside storage to take the oil - and there's also the loss of revenue as well,\" he said."
  },
  {
    "title": "Ukrainian banned from Winter Olympics over helmet honouring dead athletes",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/articles/c309pj8d8qqo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 08:32:14 GMT",
    "compressed_text": "Ukrainian skeleton racer Vladyslav Heraskevych is banned from competing at the Winter Olympics for continuing to wear a helmet which features images of athletes killed during Russia's invasion of his home country."
  },
  {
    "title": "'Costly and devastating' error sees GB miss figure skating medal",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/articles/czr073m884yo?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 23:00:57 GMT",
    "compressed_text": "Fear, 26, and 31-year-old Gibson were fourth after the rhythm dance – the first section of the ice dance competition - leaving them work to do. They scored 85.47 in their rhythm dance to lie behind Gilles and Poirier in third. It meant Fear and Gibson needed to deliver a showstopping performance in their Scottish-themed free dance to earn Britain's first medal of the 2026 Winter Games. Resplendent in tartan, they danced to The Bonnie Banks of Loch Lomond, Auld Lang Syne and The Proclaimers hit I"
  },
  {
    "title": "Vonn 'making progress' after third leg operation",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/articles/c3v7lp9ygv7o?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 18:33:39 GMT",
    "compressed_text": "Lindsey Vonn says she is \"making progress\" after having a successful third surgery on the broken leg she sustained in a crash at the Winter Olympics on Sunday. The American great was racing just nine days after rupturing ligaments in her left knee when she struck a gate 13 seconds into her downhill run in Cortina. She was airlifted off the piste and taken to hospital in Treviso, where she was diagnosed with a \"complex tibia fracture\" in her left leg. \"I had my third surgery today and it was succ"
  },
  {
    "title": "GB start skeleton bid as Kim targets history - Thursday's guide",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/articles/c338y36kngzo?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 21:40:57 GMT",
    "compressed_text": "Two-time reigning world champion Weston dominated at the World Cup this season, while team-mate Marcus Wyatt is also among the medal contenders at these Games. The first two of four runs take place today (08:30 and 10:08) on the new track in Cortina, with the final the next day. Alpine skiing: Women's Super-G (10:30)\n\nThis event promises to be one of the most entertaining – and open – of the entire Games. Home hopes lie with all-rounder Sofia Goggia, while 2018 Olympic champion Ester Ledecka, Br"
  },
  {
    "title": "I died for 40 minutes - here's what it taught me about life",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c0jvxwvdy4zo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 00:06:28 GMT",
    "compressed_text": "\"The most important thing to me has always been my family, but now I am able to give so much more of myself to it. Before I was living almost on the surface of it,\" he says."
  },
  {
    "title": "Game-changing cancer test means I met my granddaughter",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c33jv6j83m5o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 06:11:20 GMT",
    "compressed_text": "Sepsis mistakes killed our daughter - we fear it could happen again\n\nGrieving parents, former cricketer Steve James and his wife Jane, want better sepsis training to be introduced urgently so no family goes through what they did."
  },
  {
    "title": "The Dutch love four-day working weeks, but are they sustainable?",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cx2y85xdyw3o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 00:00:05 GMT",
    "compressed_text": "\"The work-life balance was at the heart of it,\" adds de Wit, who disagrees with the suggestion that their staff are now doing less work for the same amount of money. Instead he puts it down to \"working smarter not harder\"."
  },
  {
    "title": "Four takeaways from US Attorney General Pam Bondi's fiery Epstein testimony",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cq6ql2n917zo?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 22:00:57 GMT",
    "compressed_text": "The attorney general said at another point during the hearing that officials were doing their best to protect victims in the timeframe allotted by the legislation which required the files to be released. She said any names brought to them that have been released \"inadvertently\" have been \"immediately redacted\"."
  },
  {
    "title": "Chris Mason: Latest vetting row raises fresh concerns over Starmer's judgement",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c0mgzr3e18jo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 03:13:29 GMT",
    "compressed_text": "\"I was asked to speak to Matthew Doyle by Morgan McSweeney regarding Doyle's relationship with Sean Morton. I accurately relayed what Doyle had told me to the PM. The PM is right to state that Doyle did not tell me about his campaigning in a council election for Morton. Doyle did however tell me that he had believed Morton's protestations of innocence prior to his conviction and had been supportive of him during that time.\""
  },
  {
    "title": "Instagram boss: 16 hours of daily use is 'problematic,' not addiction",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cn71mgmzljlo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 01:19:57 GMT",
    "compressed_text": "On his way in, Mosseri was met by a crowd of people outside the courthouse, a mix of onlookers, protestors and parents not involved in the lawsuit, who nevertheless claim to have seen their children suffer from what they say was addiction to social media."
  },
  {
    "title": "Scrap proposed England holiday tax, hospitality bosses urge",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c5yjrvje8eeo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 00:04:53 GMT",
    "compressed_text": "The government's preferred approach is for the tax to be calculated as a proportion of the cost of the accommodation being provided, as opposed to a flat rate, and it says local mayors \"should consider the right level for their area.\""
  },
  {
    "title": "Don't sack cabinet secretary until Mandelson files published, Badenoch says",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c98qene0gpdo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:07:19 GMT",
    "compressed_text": "He would be the latest senior official to leave the government operation in the last week, following Sir Keir's chief of staff Morgan McSweeney and his director of communications Tim Allan, as the PM seeks to reset his team following the Mandelson scandal."
  },
  {
    "title": "Russia orders block on WhatsApp in messaging app crackdown",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/clygd10pg5lo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 10:15:47 GMT",
    "compressed_text": "Russia has argued that both WhatsApp and Telegram have refused to store Russian users' data in the country as required by law. Authorities in Moscow also allege that WhatsApp is one of the main services used to defraud and extort money from Russians - a reason they cite for people to migrate to the Max app."
  },
  {
    "title": "'I racked up £145k of debt' - Pharmacists struggling to stay afloat as costs soar",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/c3wzvd5l36yo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 06:15:40 GMT",
    "compressed_text": "\"It is simply unsustainable and unfair to expect individual pharmacy owners to remortgage their house and dip into their pension pot to subsidise the cost of prescriptions and to keep their doors open for their patient,\" he said."
  },
  {
    "title": "Laughing gas canisters explode at waste centres hundreds of times a week, firms say",
    "source": "BBC News",
    "link": "https://www.bbc.com/news/articles/cz9vl21wpgpo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 01:55:40 GMT",
    "compressed_text": "\"If it's not reports from members of the public that a car is driving erratically and that person's got a balloon in their mouth, or sadly the result of a serious or fatal injury collision where we find evidence within the vehicle."
  },
  {
    "title": "BBC News app",
    "source": "BBC News",
    "link": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 30 Apr 2025 14:04:28 GMT",
    "compressed_text": "Click here, external to download the BBC News app from the App Store for iPhone, iPad and iPod Touch. Click here, external to download the BBC News app from Google Play for Android devices. If you're outside the UK, you can download the BBC app here, external."
  },
  {
    "title": "Two More Problems For Keir Starmer?",
    "source": "BBC News",
    "link": "https://www.bbc.co.uk/sounds/play/p0n0jd91?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 20:50:00 GMT",
    "compressed_text": "Available for over a year\n\nToday, Keir Starmer was given a grilling at Prime Minister’s Questions about his decision to award a peerage to Lord Doyle. Chris unpacks PMQs and the latest revelations with Alex and James, as well as an intervention from former Prime Minister Gordon Brown calling for police to interview Andrew Mountbatten-Windsor. Plus the BBC's chief international correspondent Lyse Doucet joins the podcast from Iran as the country marks the 47th anniversary of the Islamic revolutio"
  },
  {
    "title": "Has Jeff Bezos brought down the Washington Post?",
    "source": "BBC News",
    "link": "https://www.bbc.co.uk/sounds/play/p0n0j22b?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 19:53:00 GMT",
    "compressed_text": "Available for over a year\n\nThe paper that contributed to the resignation of President Nixon over Watergate and the Vietnam war is now having to rethink its future. The Washington Post’s owner - Amazon boss Jeff Bezos - has announced mass layoffs at the newspaper, which will fundamentally change how it covers the news. When Bezos bought the paper in 2013, he reassured staff about a “new golden era for the Washington Post”, and later adopted a new slogan for the Washington Post “Democracy Dies in "
  },
  {
    "title": "Michael B. Jordan leads in a powerful story of justice and redemption",
    "source": "BBC News",
    "link": "https://www.bbc.co.uk/iplayer/episode/m001sxzv/just-mercy?at_mid=6Bcfozucbt&at_campaign=Just_Mercy&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=m001sxzv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Just_Mercy&at_bbc_team=BBC&at_nation=NET&at_creation=Film",
    "published_at": "Sun, 01 Feb 2026 02:00:37 GMT",
    "compressed_text": "In 1988, attorney Bryan Stevenson courageously chooses to fight injustice, armed with nothing but a Harvard law degree and the resolve to help people whose lives are literally on the line. More"
  },
  {
    "title": "Tuchel extends deal with England",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/football/articles/c9dnl94750zo?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:08:20 GMT",
    "compressed_text": "When Thomas Tuchel took charge of England it seemed like it was going to be a quick in and out. The German signed an 18-month contract to see him through England's World Cup campaign. Then, he was expected to return to club management. The former Borussia Dortmund, Paris St-Germain, Chelsea and Bayern Munich coach would likely have had the pick of many top jobs in the summer. Manchester United and Tottenham Hotspur are just two clubs who would have had him on their radar."
  },
  {
    "title": "Lucky break that changed Alexander-Arnold's Real future",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/football/articles/c0q3dwkq01go?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:00:13 GMT",
    "compressed_text": "When Trent Alexander-Arnold came off the bench in Real Madrid's 2-0 win against Valencia last weekend, there was much anticipation around the former Liverpool right-back's return. After another two months on the sideline, Real supporters had seen very little of the England defender this season. Since joining the Spanish side in June 2025, he has been limited to just 17 appearances in all competitions. Two separate injuries have disrupted his rhythm and denied him the sustained run of games neede"
  },
  {
    "title": "Forest open Pereira talks after sacking Dyche",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/football/articles/c98p80g568do?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 07:26:50 GMT",
    "compressed_text": "Following Forest's 0-0 draw with Wolves on Wednesday, Dyche sounded like a man who knew what was to follow. After an incredible 35 attempts on goal without scoring - more attempts than any team Dyche has managed in his 351 games in charge - the draw left them just three points clear of the drop zone. A frustrated Marinakis was pictured frequently during the City Ground draw with him appearing to be growing increasingly frustrated with every missed opportunity. Post match - and before his dismiss"
  },
  {
    "title": "Ukrainian skeleton racer feels 'emptiness' after Olympic ban",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/videos/c0mgzkny0z2o?at_medium=RSS&at_campaign=rss",
    "published_at": "Thu, 12 Feb 2026 09:44:31 GMT",
    "compressed_text": "I will never forget what he did for me - Xhaka on Arteta. Video, 00:02:47I will never forget what he did for me - Xhaka on Arteta"
  },
  {
    "title": "Will 40-point mark be needed for Premier League survival?",
    "source": "BBC News",
    "link": "https://www.bbc.com/sport/football/articles/c4gjplk9rr7o?at_medium=RSS&at_campaign=rss",
    "published_at": "Wed, 11 Feb 2026 23:39:48 GMT",
    "compressed_text": "The 40-point mark - or thereabouts - could be needed once again to guarantee Premier League survival this term, with an in-form West Ham attempting to chase down the sides above them. That mythical number has often been cited as the threshold at which managers, players and fans can relax - but the total has not actually been needed to stay up since 2010-11. Prior to that the only other occasions clubs were demoted with 40 points or more were 1996-97, 1997-98 and 2002-03. But could that be about "
  },
  {
    "title": "Border Officials Are Said to Have Caused El Paso Closure by Firing Anti-Drone Laser",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/trump-administration-el-paso-airspace-closure-questions.html",
    "published_at": "Thu, 12 Feb 2026 04:40:15 +0000",
    "compressed_text": "People familiar with the episode said the use of the technology was not coordinated with the Federal Aviation Administration. Officials targeted what they thought was a drug cartel drone, but turned out to be a party balloon, they said."
  },
  {
    "title": "What We Know About the El Paso Airspace Shutdown",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/el-paso-airspace-shutdown-what-to-know.html",
    "published_at": "Thu, 12 Feb 2026 05:50:08 +0000",
    "compressed_text": "The Trump administration blamed the disruptive halt on a cartel drone incursion, but others have disputed that explanation."
  },
  {
    "title": "Weapons Used to Fight Drones Don’t Mix Well With Civilian Airspace",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/weapons-used-to-fight-drones-dont-mix-well-with-civilian-airspace.html",
    "published_at": "Wed, 11 Feb 2026 22:10:27 +0000",
    "compressed_text": "In the race to build anti-drone weapons intended for use in a war zone, it is unclear how they may be used safely in crowded skies."
  },
  {
    "title": "Lawmakers Question Bondi Over Justice Dept. Under Her Watch",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/bondi-testimony-epstein-files.html",
    "published_at": "Thu, 12 Feb 2026 05:53:59 +0000",
    "compressed_text": "Her appearance came as the Justice Department was under scrutiny over the Epstein files, its approach toward the shootings in Minneapolis and its move to prosecute six lawmakers."
  },
  {
    "title": "Casey Wasserman Will Stay as Head of 2028 Olympics Despite Epstein Ties, Organizers Say",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/wasserman-epstein-la-olympics-2028.html",
    "published_at": "Wed, 11 Feb 2026 22:59:06 +0000",
    "compressed_text": "Casey Wasserman exchanged flirtatious messages over 20 years ago with Ghislaine Maxwell, a longtime companion of Jeffrey Epstein. The 2028 board said its review found no other indiscretions related to Mr. Epstein."
  },
  {
    "title": "Epstein Files Include Grainy Videos From Inside His Florida Home",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/epstein-files-videos.html",
    "published_at": "Wed, 11 Feb 2026 21:13:18 +0000",
    "compressed_text": "The clips from Jeffrey Epstein’s home office appear to show him with young women."
  },
  {
    "title": "U.S. Attorney Chosen to Replace Trump Pick Is Quickly Fired by White House",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/nyregion/donald-kinsella-ndny-sarcone-trump.html",
    "published_at": "Thu, 12 Feb 2026 03:12:46 +0000",
    "compressed_text": "Federal judges had appointed Donald Kinsella, a veteran litigator, as top prosecutor in the Northern District of New York after the Trump administration’s nominee was found to be serving unlawfully."
  },
  {
    "title": "India’s Prime Minister Faces Blowback Over Trade Deal With Trump to Lower Tariffs",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/12/business/modi-india-trump-trade-deal-blowback.html",
    "published_at": "Thu, 12 Feb 2026 05:15:44 +0000",
    "compressed_text": "Prime Minister Narendra Modi won a big reduction of sky-high tariffs, but critics say he undermined Indian sovereignty and undercut the nation’s farmers."
  },
  {
    "title": "House Votes to Cancel Trump’s Canada Tariffs",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/trump-canada-tariffs.html",
    "published_at": "Thu, 12 Feb 2026 00:07:41 +0000",
    "compressed_text": "Six Republicans joined nearly all Democrats to end the national emergency President Donald Trump had declared to impose tariffs on imports from Canada."
  },
  {
    "title": "James Van Der Beek, ‘Dawson’s Creek’ Actor, Dies at 48 After Cancer Battle",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/arts/television/james-van-der-beek-dead.html",
    "published_at": "Thu, 12 Feb 2026 06:42:04 +0000",
    "compressed_text": "He first appeared in a hit TV drama as a wide-eyed 15-year-old who then grew up over six seasons. He announced he had cancer in 2024."
  },
  {
    "title": "In His Second Act, James Van Der Beek Starred Online as a Proud Dad and Family Man",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/arts/television/james-van-der-beek-dad-kids.html",
    "published_at": "Thu, 12 Feb 2026 00:06:33 +0000",
    "compressed_text": "The actor, who died on Wednesday, was most famous for “Dawson’s Creek,” but as he got older, he let fans into his real life as a father of six."
  },
  {
    "title": "Olympic Figure Skaters Are on Thin Ice Over Music Copyright Rules",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/12/world/europe/winter-olympics-figure-skating-music-copyright.html",
    "published_at": "Thu, 12 Feb 2026 08:51:14 +0000",
    "compressed_text": "Several athletes have found themselves caught up in controversies over musical choices before and during one of the biggest competitions of their careers."
  },
  {
    "title": "Ukrainian Olympian Is Disqualified Over Helmet With Images of War Dead",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/12/world/olympics/ukraine-skeleton-olympics-banned-helmet-heraskevych.html",
    "published_at": "Thu, 12 Feb 2026 09:55:09 +0000",
    "compressed_text": "Olympic officials had told Vladyslav Heraskevych that the helmet, featuring images of Ukrainian athletes killed in the war with Russia, violated the Games’ ban on political speech."
  },
  {
    "title": "Gallup Will No Longer Track Presidential Approval Ratings",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/gallup-poll-presidential-approval-ratings-trump.html",
    "published_at": "Wed, 11 Feb 2026 22:36:16 +0000",
    "compressed_text": "The monthly poll has been used to measure presidential performance for almost nine decades."
  },
  {
    "title": "Eyeing the Midterms, Kennedy Pivots Toward Food and Away From Vaccines",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/rfk-pivot-food-vaccines.html",
    "published_at": "Thu, 12 Feb 2026 02:03:57 +0000",
    "compressed_text": "Health Secretary Robert F. Kennedy Jr., who focused heavily on vaccine policy in 2025, will spend this year talking up healthy eating."
  },
  {
    "title": "House Passes Strict Voter ID Bill, Amplifying Trump’s Claims of Fraud",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/house-passes-voter-id-bill.html",
    "published_at": "Thu, 12 Feb 2026 02:03:33 +0000",
    "compressed_text": "The measure had no path forward in the Senate, where Democrats are all but certain to block it and Republicans have said they will not try to skirt filibuster rules to ram it through."
  },
  {
    "title": "Trump Says He Will Now Invite Democrats to Governors’ Meeting",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/us/politics/trump-governors-meeting-democrats.html",
    "published_at": "Thu, 12 Feb 2026 02:09:09 +0000",
    "compressed_text": "Even as he reversed course on excluding Democrats, the president repeatedly attacked a Republican governor who had planned to oversee the meeting."
  },
  {
    "title": "Why Nancy Guthrie’s Disappearance Is Breaking Through the Noise",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/style/nancy-guthrie-missing-savannah.html",
    "published_at": "Thu, 12 Feb 2026 02:28:50 +0000",
    "compressed_text": "A vulnerable victim, an unknown perpetrator and a recognizable celebrity are all factors in a case that has captivated the public."
  },
  {
    "title": "Bangladesh Holds First Elections After 2024 Student Protests",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/world/asia/bangladesh-election-students.html",
    "published_at": "Thu, 12 Feb 2026 07:28:54 +0000",
    "compressed_text": "At the vanguard of Gen Z movements, protesters in Bangladesh ousted the prime minister in 2024. They now face the hard reality of winning change through elections."
  },
  {
    "title": "The Bangladesh Elections Are on Thursday. Here’s What to Know.",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/world/asia/bangladesh-elections.html",
    "published_at": "Wed, 11 Feb 2026 09:24:14 +0000",
    "compressed_text": "Bangladesh is holding national elections for the first time since 2024, when a student movement ousted the prime minister."
  },
  {
    "title": "Bud Cort, Who Starred in 1971’s ‘Harold and Maude,’ Dies at 77",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/movies/bud-cort-dead.html",
    "published_at": "Thu, 12 Feb 2026 03:13:24 +0000",
    "compressed_text": "The role, one of his first, made him a household name and a film idol of the anti-establishment 1970s. But it also limited his growth as an actor."
  },
  {
    "title": "Man Accused of Murdering His Father Once Sought to Seize Stranger’s Baby",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/nyregion/henry-mcgowan-ireland-murder-trial.html",
    "published_at": "Thu, 12 Feb 2026 04:07:30 +0000",
    "compressed_text": "Henry McGowan of New York is on trial for murder in Ireland and has pleaded not guilty by reason of insanity. Prosecutors outlined a previous psychotic break."
  },
  {
    "title": "When It’s Finally Cold Enough to Race Ice Yachts",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/nyregion/ice-yachting-race-navesink-river.html",
    "published_at": "Wed, 11 Feb 2026 21:23:04 +0000",
    "compressed_text": "On the Navesink River, a long and frigid winter has allowed a 135-year-old rivalry to be renewed."
  },
  {
    "title": "End ICE Lawlessness",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/12/opinion/ice-congress-trump-dhs.html",
    "published_at": "Thu, 12 Feb 2026 10:07:56 +0000",
    "compressed_text": "Congress must stand firm against President Trump’s assault on the rule of law."
  },
  {
    "title": "Is Claude Coding Us Into Irrelevance?",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/12/opinion/artificial-intelligence-anthropic-amodei.html",
    "published_at": "Thu, 12 Feb 2026 10:06:27 +0000",
    "compressed_text": "Dario Amodei shares his utopian — and dystopian — predictions for the near-term future of artificial intelligence."
  },
  {
    "title": "LaMonte McLemore, Founding Singer With the 5th Dimension, Dies at 90",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/arts/music/lamonte-mclemore-dead.html",
    "published_at": "Wed, 11 Feb 2026 22:27:21 +0000",
    "compressed_text": "His group notched smooth hippie-era hits like “Up, Up and Away” and “The Age of Aquarius” in embracing a genre-blurring sound they called “champagne soul.”"
  },
  {
    "title": "Baby, 17 Days Old, Found Dead From Fire That Killed Her Mother",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/nyregion/fire-deaths-infant-mother-queens.html",
    "published_at": "Thu, 12 Feb 2026 01:56:57 +0000",
    "compressed_text": "Two days after a fatal house fire in Queens, firefighters returned to the wreckage and found Emma Alcantara’s body. She and her mother, Miguelina, lived in an illegal basement apartment."
  },
  {
    "title": "Nurses at 4 N.Y.C. Hospitals Vote to End Strike, but It Continues at One",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/nyregion/nyc-nurses-strike-vote.html",
    "published_at": "Thu, 12 Feb 2026 01:12:20 +0000",
    "compressed_text": "At Montefiore and Mount Sinai hospitals, health care workers ratified a deal to end the walkout, but nurses remain on the picket line at NewYork-Presbyterian/Columbia."
  },
  {
    "title": "This Comet Stopped Spinning. Then It Started Rotating Backward.",
    "source": "NYT > Top Stories",
    "link": "https://www.nytimes.com/2026/02/11/science/comet-spinning-backwards.html",
    "published_at": "Thu, 12 Feb 2026 02:19:44 +0000",
    "compressed_text": "The unusual event, never seen before, might be a way small comets are “blown to bits” in the solar system."
  },
  {
    "title": "53 people dead or missing after migrant boat capsizes in Mediterranean",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/09/deaths-migrant-boat-capsizes-mediterranean-libya",
    "published_at": "Mon, 09 Feb 2026 14:43:13 GMT",
    "compressed_text": "Fifty-three people are dead or missing after a boat capsized in the Mediterranean Sea off the Libyan coast, the UN migration agency said on Monday. Only two survivors were rescued. The International Organization for Migration said the boat overturned north of Zuwara on Friday, in the latest disaster involving people attempting the perilous Mediterranean crossing in the hope of reaching Europe. In a statement, the IOM said: “Only two Nigerian women were rescued during a search and rescue operatio"
  },
  {
    "title": "Ebo Taylor, Ghanaian highlife pioneer and guitarist, dies age 90",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/music/2026/feb/09/ebo-taylor-ghanaian-highlife-pioneer-dies-age-90",
    "published_at": "Mon, 09 Feb 2026 13:44:54 GMT",
    "compressed_text": "Ghanaian musician Ebo Taylor, a definitive force behind the highlife genre, has died age 90. His son Kweku Taylor announced the news on Sunday: “The world has lost a giant. A colossus of African music. Ebo Taylor passed away yesterday; a day after the launch of Ebo Taylor music festival and exactly a month after his 90th birthday, leaving behind an unmatched artistry legacy. Dad, your light will never fade.”\n\nA spokesperson for the Ghanaian president told the BBC’s Newsday programme that Taylor "
  },
  {
    "title": "Weather tracker: Spain and Portugal hit by third deadly storm in two weeks",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/environment/2026/feb/09/weather-tracker-spain-and-portugal-hit-by-third-fatal-storm",
    "published_at": "Mon, 09 Feb 2026 11:00:20 GMT",
    "compressed_text": "Spain and Portugal have endured another storm over the weekend, just days after the deadly flooding and major damage caused by Storm Kristin and Storm Leonardo last week. Storm Marta passed over the Iberian peninsula on Saturday, bringing fresh torrential rain and killing two people. Storm Kristin killed at least five people after it made landfall on 28 January with Storm Leonardo claiming another victim last Wednesday. The outlook for this week is for more rain across Spain, Portugal and France"
  },
  {
    "title": "RSF drone attack kills 24 people fleeing fighting in central Sudan, says doctors group",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/07/sudan-rsf-drone-attack-rahad-kills-displaced-people",
    "published_at": "Sat, 07 Feb 2026 20:03:07 GMT",
    "compressed_text": "A drone attack by a paramilitary group has hit a vehicle carrying displaced families in central Sudan, killing at least 24 people, including eight children, a doctors’ group said on Saturday. The attack by the Rapid Support Forces took place close to the city of Er Rahad in North Kordofan province, according to the Sudan Doctors Network, which tracks the country’s war. The vehicle was transporting displaced people who fled fighting in the Dubeiker area, the group said in a statement. Among the d"
  },
  {
    "title": "Thousands of Malawi businesses close in protest over tax changes",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/global-development/2026/feb/07/businesses-close-protest-malawi-tax-changes-electronic-invoicing-system",
    "published_at": "Sat, 07 Feb 2026 12:00:01 GMT",
    "compressed_text": "Demonstrations across Malawi’s four main cities during the past week have achieved a delay in the introduction of a new tax regime that business owners claim will cripple their livelihoods. Tens of thousands had signed petitions which this week were presented to tax officials and on Monday thousands of small traders shut up shops and businesses to hold protest marches in Blantyre, Lilongwe, Zomba and Mzuzu. The actions have achieved a delay in the rollout of the electronic invoicing system (EIS)"
  },
  {
    "title": "Canadian police identify suspect in school massacre that left nine dead",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/tumbler-ridge-canada-shooting-school-mark-carney",
    "published_at": "Thu, 12 Feb 2026 00:55:08 GMT",
    "compressed_text": "Canadian police have identified the suspect who carried out a school massacre in remote British Columbia as an 18-year old with a history of mental health problems. Six people, including a teacher and five students, were killed in the attack on Tuesday in the town of Tumbler Ridge, in the foothills of the Rocky mountains. The suspect’s mother and step-brother were later found dead at the family home, police said. The body of the shooter, Jesse Van Rootselaar, was also found with a self-inflicted"
  },
  {
    "title": "US House backs bid to block Canada tariffs in rebuke of Trump",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/2026/feb/11/us-house-vote-trump-canada-tariffs",
    "published_at": "Thu, 12 Feb 2026 00:48:09 GMT",
    "compressed_text": "The US House on Wednesday voted to rescind tariffs that Donald Trump imposed on Canada last year, a rare bipartisan rebuke of the White House’s trade policy as the president threatened electoral retaliation against any Republican who defied him. The largely symbolic resolution to disapprove of the national emergency Trump declared to impose tariffs on Canada passed 219 to 211, with six Republicans – Don Bacon of Nebraska, Thomas Massie of Kentucky, Brian Fitzpatrick of Pennsylvania, Kevin Kiley "
  },
  {
    "title": "Tumbler Ridge school shooting: police identify suspect in Canada attack as 18-year-old local resident – as it happened",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/live/2026/feb/11/tumbler-ridge-school-shooting-live-updates-number-dead-suspect-deceased",
    "published_at": "Wed, 11 Feb 2026 22:34:36 GMT",
    "compressed_text": "From 13h ago 20.41 GMT What we learned from the police briefing on the Tumbler Ridge shootings Deputy commissioner Dwayne McDonald confirmed that police have identified the suspect as 18-year-old Jesse Van Rootselaar, who was a resident of Tumbler Ridge. Police revised the death toll down to nine people, including the suspect, after a female victim with significant injuries survived (she remains in critical condition). A 39-year-old found deceased at the suspect’s family residence was the mother"
  },
  {
    "title": "Canada shooting: Nine dead including suspect in attack on Tumbler Ridge high school, police say",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/canada-school-shooting-ten-dead-including-suspect-in-attack-on-tumbler-ridge-secondary-school-and-residence-police-say",
    "published_at": "Wed, 11 Feb 2026 21:54:40 GMT",
    "compressed_text": "Nine people have been killed and dozens injured after an assailant opened fire at a school in western Canada, in one of the deadliest mass shootings in the country’s history. The suspect was later found dead from what appeared to be a self-inflicted injury. Police found six people dead inside the high school in the remote town of Tumbler Ridge in British Columbia, with a further two bodies found at a residence believed to be connected to the incident. Another person initially believed to have di"
  },
  {
    "title": "Alleged drones in El Paso airspace cast spotlight on Mexican cartels’ growing arsenals",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/mexican-cartel-drones-el-paso",
    "published_at": "Wed, 11 Feb 2026 19:57:56 GMT",
    "compressed_text": "An alleged incursion by Mexican cartel drones into US airspace and the sudden closure of El Paso’s airspace has drawn renewed attention to the use of high-powered weapons by organized crime groups in Mexico. There were conflicting accounts on Wednesday about whether the city’s airspace was shut down due to cartel drones or a disagreement over the Pentagon testing of counter-drone technology, but experts say the use of drones by drug gangs at the border has become increasingly common. Veronica Es"
  },
  {
    "title": "Father of activist Anna Kwok convicted under Hong Kong national security law",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/kwok-yin-sang-father-hong-kong-activist-anna-kwok-convicted",
    "published_at": "Wed, 11 Feb 2026 15:02:58 GMT",
    "compressed_text": "A Hong Kong court has found the father of a wanted activist guilty of a national security violation, after he tried to end her insurance policy and withdraw the funds, drawing international criticism for the targeting of relatives of pro-democracy campaigners. Kwok Yin-sang, 68, is the first person to be charged under a homegrown national security law, also known as Article 23, for “attempting to deal with, directly or indirectly, any funds or other financial assets or economic resources” belong"
  },
  {
    "title": "‘Wake-up call’ for Greece as air force officer accused of spying for China",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/10/greek-air-force-officer-arrested-on-suspicion-of-spying-for-china",
    "published_at": "Tue, 10 Feb 2026 19:04:29 GMT",
    "compressed_text": "A Greek air force officer arrested on suspicion of spying for China has been detained pending trial after appearing before a military judge in a case that is seen as exposing Beijing’s determination to infiltrate Europe’s security and intelligence services. Surrounded by armed escorts, a squadron leader identified as Col Christos Flessas emerged from the court late on Tuesday after giving testimony for more than eight hours. The 54-year-old could face a life sentence if found guilty of charges t"
  },
  {
    "title": "Hong Kong’s once-vibrant press stays silent or celebrates Jimmy Lai’s 20-year jail sentence",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/10/jimmy-lai-jail-sentence-hong-kong-press",
    "published_at": "Tue, 10 Feb 2026 14:14:48 GMT",
    "compressed_text": "Hong Kong’s once-vibrant media outlets have responded with silence or celebration to the 20-year jail sentence handed down to Jimmy Lai, a pro-democracy media tycoon and critic of the Chinese Communist party. Lai, 78, was sentenced on Monday to 20 years in prison after being convicted of sedition and colluding with foreign forces under Hong Kong’s national security law. The charges were widely seen as being politically motivated and designed to silence one of Hong Kong’s most influential pro-dem"
  },
  {
    "title": "Parents of Melbourne methanol-poisoning victims ‘shocked’ by $185 fines handed to Laos hostel staff",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/10/parents-of-melbourne-methanol-poisoning-victims-shocked-by-185-fines-handed-to-laos-hostel-staff",
    "published_at": "Tue, 10 Feb 2026 00:20:33 GMT",
    "compressed_text": "The families of two Melbourne teenagers who died after drinking methanol-laced alcohol in Laos say they have been blindsided by news the workers responsible for serving the drinks received fines of just $185. Bianca Jones and Holly Morton-Bowles, both 19, were killed by methanol poisoning along with four other tourists after a night out at the Nana backpackers hostel in Vang Vieng, a popular tourist destination in Laos, in November 2024. More than a year later, the girls’ fathers, Shaun Bowles a"
  },
  {
    "title": "US judges dismiss lawsuits accusing Neil Gaiman of sexual assault",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/books/2026/feb/09/us-judges-lawsuits-neil-gaiman",
    "published_at": "Tue, 10 Feb 2026 00:01:52 GMT",
    "compressed_text": "Federal judges have dismissed three lawsuits accusing the bestselling fantasy author Neil Gaiman of sexually assaulting his children’s nanny in New Zealand four years ago. Scarlett Pavlovich filed a lawsuit against Gaiman and his wife, Amanda Palmer, in Wisconsin in February 2025, accusing Gaiman of multiple sexual assaults while she worked as the family’s nanny in 2022. She filed lawsuits against Palmer in Massachusetts and in New York on the same day she filed the Wisconsin action. Gaiman has "
  },
  {
    "title": "Concerns for former Canberra boy in Iran, as Australia makes representations to Tehran",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/australia-news/2026/feb/12/fears-former-canberra-boy-has-been-executed-in-iran-as-australia-makes-representations-to-tehran",
    "published_at": "Thu, 12 Feb 2026 09:56:07 GMT",
    "compressed_text": "There are grave fears for a former Canberra high school student after claims he was killed in Iran, amid representations by the Australian government to Tehran over the potential execution of prisoners. Posts on social media accounts linked to the boy suggest he died on Friday, after reportedly being detained in Iran. The claims could not be verified. However, wellbeing support has been offered to former classmates of the boy – who was not an Australian citizen – by his former high school in the"
  },
  {
    "title": "Thousands gather at Melbourne Herzog protest – as it happened",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/australia-news/live/2026/feb/12/australia-politics-live-liberals-leadership-spill-challenge-angus-taylor-sussan-ley-libspill-question-time-anthony-albanese-senate-estimates-ntwnfb",
    "published_at": "Thu, 12 Feb 2026 08:46:52 GMT",
    "compressed_text": "2h ago 08.07 GMT Liberal senator who previously supported Ley resigns to back Taylor Dan Jervis-Bardy The Liberal senator, Dean Smith, has quit the shadow ministry to back Angus Taylor’s leadership bid – the 10th frontbencher to resign on Thursday, ahead of tomorrow’s spill. Smith’s resignation is a blow to Sussan Ley because he supported her in last year’s leadership ballot. The West Australian senator, who is the shadow assistant minister for foreign affairs and energy and emissions reduction,"
  },
  {
    "title": "Liberal party on brink of dumping first female leader with Taylor’s backers confident of defeating Ley",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/australia-news/2026/feb/12/liberal-party-on-brink-of-dumping-first-female-leader-with-taylors-backers-confident-of-defeating-ley",
    "published_at": "Thu, 12 Feb 2026 08:20:09 GMT",
    "compressed_text": "The Liberal party is on the brink of dumping its first female leader, with Angus Taylor’s backers confident of defeating Sussan Ley in Friday’s leadership vote. The embattled opposition leader faced a tide of 10 resignations by 7pm on Thursday, with frontbenchers including Dan Tehan, Michaelia Cash, Jonathon Duniam, James McGrath and Dean Smith all abandoning Ley to vote for Taylor. Both sides agreed a handful of votes could decide whether a party room spill motion succeeds after 9am on Friday, "
  },
  {
    "title": "Anthony Albanese raises bulldozed Australian war graves with Israeli president",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/australia-news/2026/feb/12/anthony-albanese-isaac-herzog-bulldozed-australian-war-graves-gaza",
    "published_at": "Thu, 12 Feb 2026 06:43:55 GMT",
    "compressed_text": "The prime minister, Anthony Albanese, has raised the issue of Australian war graves bulldozed by the Israeli military in Gaza directly with the Israeli president, Isaac Herzog. Dozens of Australian war graves – mostly soldiers who died in Palestine during the second world war – were bulldozed by the Israel Defense Forces across April and May last year. Satellite images show the southern corner of the Gaza Commonwealth War Cemetery being obliterated, with headstones destroyed and soil pushed by m"
  },
  {
    "title": "Rebel Queensland LNP MP urges colleagues to ‘put on the full armour of God’ and speak against abortion",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/australia-news/2026/feb/12/nigel-dalton-mp-queensland-lnp-abortion-ntwnfb",
    "published_at": "Thu, 12 Feb 2026 06:36:30 GMT",
    "compressed_text": "The rebel Liberal National party Queensland MP Nigel Dalton, who earlier this week defied the state’s premier, David Crisafulli, over the abortion law debate, has encouraged others “to put on the full armour of God” and speak out on the issue. In an interview posted on YouTube, Dalton told the anti-abortion activist Joanna Howe his “history with anti-abortion has been probably 30-odd years in the making”. Howe asked the Mackay MP if he had any advice for other members of his party who felt under"
  },
  {
    "title": "Nearly 300,000 people in Ukrainian city of Odesa without power or water after Russian drone strikes - Europe live",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/live/2026/feb/12/ukraine-russia-strikes-odesa-power-drone-strikes-zelenskyy-putin-portugal-floods-europe-live-news",
    "published_at": "Thu, 12 Feb 2026 09:59:17 GMT",
    "compressed_text": "08.43 GMT Morning opening\n\nHello, Taz Ali here to bring you the latest news for our Europe live blog. Hundreds of thousands of people have been left without power or water supply in the southern Ukrainian city of Odesa after Russia launched a large-scale overnight drone strike, according to local officials. Nearly 300,000 people have been affected by the power outage, while one person has been reported injured. It was part of a widespread attack across the country that targeted energy infrastruc"
  },
  {
    "title": "EU leaders to clash over ‘Buy European’ push at Belgium summit",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/12/eu-leaders-clash-buy-european-belgium-summit",
    "published_at": "Thu, 12 Feb 2026 09:38:59 GMT",
    "compressed_text": "EU leaders are expected to diverge on whether “Buy European” is an answer to Europe’s waning economic fortunes, at a summit on how to secure the continent’s future in a more volatile global economy. At a moated castle in the east Belgian countryside, the EU’s 27 leaders will gather on Thursday for a brainstorming session on how Europe can regain its economic competitiveness vis-a-vis the US and China, at a time of economic threats and political turbulence. Arriving at the summit on Thursday, the"
  },
  {
    "title": "Switzerland to vote on far-right proposal to cap population at 10 million",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/12/switzerland-to-vote-on-far-right-proposal-to-cap-population-at-10-million",
    "published_at": "Thu, 12 Feb 2026 06:00:40 GMT",
    "compressed_text": "Switzerland will vote this summer on a proposal from the far-right Swiss People’s party (SVP) to limit the country’s population to 10 million, a move that would threaten key agreements with the EU and, opponents say, cripple the economy. The government said on Wednesday the referendum on the SVP’s “No to a 10 million Switzerland” initiative, which is strongly opposed by both chambers of parliament and the business and financial services community, would be held on 10 June. The initiative would o"
  },
  {
    "title": "Russia attempted to ‘fully block’ WhatsApp, Meta-owned company says",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/12/russia-attempt-block-whatsapp-meta-says",
    "published_at": "Thu, 12 Feb 2026 05:49:21 GMT",
    "compressed_text": "Russia has attempted to “fully block” WhatsApp in an attempt to push users towards its own state-sponsored communications app, Max, a spokesperson for the Meta-owned company has said. The company did not reveal more detail on what extent the attempt succeeded or what action was taken to try to block the app. Speaking to the Guardian, the WhatsApp spokesperson said: “Trying to isolate over 100 million users from private and secure communication is a backwards step and can only lead to less safety"
  },
  {
    "title": "Cees Nooteboom, Dutch novelist and travel writer, dies aged 92",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/books/2026/feb/11/cees-nooteboom-dutch-author-dies-aged-92",
    "published_at": "Wed, 11 Feb 2026 23:40:16 GMT",
    "compressed_text": "The Dutch writer Cees Nooteboom, whose novels, travel writing and translations made him a prominent literary figure in postwar Europe, has died aged 92. Publishing house De Bezige Bij said in a statement on Wednesday evening that Nooteboom had “passed away very peacefully on his beloved island Menorca”. The statement was made on behalf of the author’s wife, the photographer Simone Sassen. “We will miss the friendship, erudition, enthusiasm and individuality of this internationally acclaimed writ"
  },
  {
    "title": "Marwan Barghouti’s son calls on UK to put father’s release at heart of Palestinian renewal",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/marwan-barghouti-son-uk-father-release-palestine-renewal",
    "published_at": "Wed, 11 Feb 2026 20:06:32 GMT",
    "compressed_text": "The son of Marwan Barghouti, the Palestinian prisoner often described as the Nelson Mandela of the Palestinian movement, has called on the British government to put his father’s release at the heart of Palestinian democratic renewal. Arab Barghouti warned the UK government that its recent recognition of a Palestinian state risks providing nothing but false hope unless it follows through by using diplomatic channels to secure his father’s freedom. “Simply saying ‘we support a two-state solution’ "
  },
  {
    "title": "Iran’s president denies it seeks nuclear weapon and admits ‘shame’ after mass protests",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/iran-president-denies-it-seeks-nuclear-weapon-admits-shame-after-protests",
    "published_at": "Wed, 11 Feb 2026 15:19:52 GMT",
    "compressed_text": "Iran’s president insisted his country was not seeking a nuclear weapon as he acknowledged “great sorrow” after the authorities’ recent crackdown on protesters. Speaking to crowds gathered across Iran to mark the anniversary of the 1979 revolution, Masoud Pezeshkian sought to claim a message of national unity after demonstrations that roiled the country and triggered an unprecedented crisis for the regime. The comments were made against a backdrop of negotiations with the US that hang in the bala"
  },
  {
    "title": "Family of worker killed on Saudi World Cup site still waiting for compensation a year on",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/global-development/2026/feb/11/family-worker-killed-saudi-world-cup-site-still-waiting-compensation-year-mohammad-arshad",
    "published_at": "Wed, 11 Feb 2026 07:00:13 GMT",
    "compressed_text": "When Mohammad Arshad fell to his death while constructing the first new stadium for the 2034 World Cup in Saudi Arabia, one of the main stadium contractors, the Belgian construction multinational Besix, promised it would take immediate steps to ensure all end-of-service and insurance payments were, “handled in a timely and respectful manner”. Almost a year later, Arshad’s family say they have yet to receive either. Arshad’s death was the first known fatality of a migrant worker linked to the 203"
  },
  {
    "title": "‘A step in the wrong direction’: Israel’s West Bank plans prompt global backlash",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/10/israel-west-bank-plans-global-backlash",
    "published_at": "Wed, 11 Feb 2026 01:59:13 GMT",
    "compressed_text": "Israeli measures to tighten its control of the West Bank have prompted a global backlash, including a signal from Washington restating the Trump administration’s opposition to annexation of the occupied territory. Announcing the measures, which involve extending Israeli control in areas that are currently under Palestinian administration, Israel’s defence minister, Israel Katz, made clear they were aimed at strengthening Israeli settlements in the West Bank and pre-empting the emergence of an in"
  },
  {
    "title": "Iran tells US not to let Netanyahu thwart nuclear talks before Trump meeting",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/10/iran-tells-us-not-to-let-netanyahu-thwart-nuclear-talks-before-trump-meeting",
    "published_at": "Tue, 10 Feb 2026 19:34:01 GMT",
    "compressed_text": "Tehran has told the US not to allow Israel to destroy the chance of reaching an agreement over Iran’s nuclear programme amid speculation that Benjamin Netanyahu intends to use a hastily arranged White House meeting with Donald Trump on Wednesday to divert negotiations. Iran’s intervention came as the Israeli prime minister flew to Washington to plead with Trump not to negotiate a deal with Tehran if it excludes limiting the country’s ballistic missile programme, dropping its support for proxy fo"
  },
  {
    "title": "Tarique Rahman promises era of clean politics as Bangladesh holds first election since fall of Hasina",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/12/tarique-rahman-bnp-bangladesh-election",
    "published_at": "Thu, 12 Feb 2026 01:10:15 GMT",
    "compressed_text": "Tarique Rahman, who after 17 years in exile is the main contender to be the next prime minister of Bangladesh, has pledged to end entrenched corruption and put the country on a “new path” as voting began in the first free and fair elections in almost two decades. Speaking to the Guardian before polls opened on Thursday morning, Rahman promised a new era of clean politics, including a “top down, no tolerance” approach to graft, if his Bangladesh Nationalist party (BNP) was brought to power. Accor"
  },
  {
    "title": "‘Women’s freedoms are at stake’: concern at rise of Islamist party before Bangladesh election",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/11/bangladesh-election-islamist-party-women-freedoms",
    "published_at": "Wed, 11 Feb 2026 02:00:03 GMT",
    "compressed_text": "As the clock hit midnight, the women held their flame torches aloft and marched into the Dhaka night. “The people have given their blood, now we want equality,” they shouted above the roar of the traffic. For many in Bangladesh, the past few weeks have been a cause for jubilation. The first free and fair elections in 17 years have been promised for Thursday, after the toppling of the regime of Sheikh Hasina in a bloody student-led uprising in August 2024 in which more than 1,000 people died. Opp"
  },
  {
    "title": "Traditional food could help reverse Nepal’s ‘diabetes epidemic’, studies suggest",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/global-development/2026/feb/10/traditional-food-could-help-reverse-nepals-diabetes-epidemic-studies-suggest",
    "published_at": "Tue, 10 Feb 2026 10:00:18 GMT",
    "compressed_text": "A return to the traditional lentil and rice dishes that have nourished generations of Nepalis could save them from a diabetes epidemic prompted by the influx of western junk foods, doctors have said. In a country where one in five of those over 40 has type 2 diabetes, the foods enjoyed by their grandparents have showed remarkable results in reversing the condition. Diabetes medication is largely unaffordable in Nepal, and type 2 diabetes often sets off a cascade of complications which can includ"
  },
  {
    "title": "One person dead from Nipah virus in Bangladesh, WHO says",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/07/one-person-dead-from-nipah-virus-in-bangladesh-who-says",
    "published_at": "Sat, 07 Feb 2026 01:45:43 GMT",
    "compressed_text": "The World Health Organization said on Friday that a woman had died in northern Bangladesh in January after contracting the deadly Nipah virus infection. The case in Bangladesh, where Nipah cases are reported almost every year, follows two Nipah virus cases identified in neighbouring India, which has already prompted stepped-up airport screenings across Asia. The patient in Bangladesh – aged between 40 and 50 – developed symptoms consistent with Nipah virus on 21 January, including fever and head"
  },
  {
    "title": "Mosque bombing in Pakistan capital kills at least 31 people",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/world/2026/feb/06/bombing-explosion-shia-mosque-pakistan-islamabad",
    "published_at": "Fri, 06 Feb 2026 14:57:10 GMT",
    "compressed_text": "An explosion has ripped through a Shia mosque on the outskirts of Pakistan’s capital during Friday prayers, killing 31 people and injuring at least 169 others, according to officials. Police said they were investigating whether the attack was carried out by a suicide bomber. There were fears the death toll from the blast at the Khadija al-Kubra mosque in Islamabad could rise as some of the injured were reported to be in a critical condition. Television footage and social media images showed poli"
  },
  {
    "title": "Minister and Burnham escalate row with ‘hypocritical’ Ratcliffe over claim UK colonised by immigrants – politics live",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/politics/live/2026/feb/12/uk-politics-latest-news-updates-labour-jim-ratcliffe-keir-starmer",
    "published_at": "Thu, 12 Feb 2026 10:16:35 GMT",
    "compressed_text": "He also suggested that Ratcliffe has been “siphoning wealth” out of Manchester United , while offering “little contribution” to the city. Calling for curbs on levels of immigration is one thing; portraying those who come here as a hostile invading force is quite another. These comments go against everything for which Manchester has traditionally stood: a place where people of all races, faiths and none have pulled together over centuries to build our city and our institutions, including Manchest"
  },
  {
    "title": "Boy, 13, charged with attempted murder after two pupils stabbed at London school",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/uk-news/2026/feb/12/boy-charged-attempted-murder-two-pupils-stabbed-london-school",
    "published_at": "Thu, 12 Feb 2026 09:52:49 GMT",
    "compressed_text": "A 13-year-old boy has been charged with attempted murder after two pupils were stabbed at a secondary school in north-west London. The teenager, who has not been named because of his age, is due to appear at Westminster magistrates court on Thursday, the Metropolitan police said. He is accused of the attempted murder of two boys aged 12 and 13, and unlawfully and maliciously administering a noxious thing to a third child for allegedly spraying them with an unnamed substance. The incident happene"
  },
  {
    "title": "Schroders agrees £9.9bn takeover by US investor, ending 200 years of family ownership",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/business/2026/feb/12/schroders-takeover-us-investor-end-200-years-family-ownership-asset-management",
    "published_at": "Thu, 12 Feb 2026 09:39:25 GMT",
    "compressed_text": "Schroders has agreed a £9.9bn takeover by a US investor, ending two centuries of family ownership of the historic British asset management group. Chicago-based Nuveen will buy the City firm, it said on Thursday, in a deal that will create one of the world’s biggest fund managers, controlling about $2.5tn (£1.8tn) of assets. The takeover ends two centuries of independence for the group, which will keep London as its largest office with about 3,100 workers and retain its Schroders branding. Founde"
  },
  {
    "title": "UK economy limps along at 0.1% growth – but there are reasons for optimism in 2026",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/business/2026/feb/12/uk-economy-gdp-reasons-for-optimism-analysis",
    "published_at": "Thu, 12 Feb 2026 09:14:00 GMT",
    "compressed_text": "Rachel Reeves has suggested 2026 is the year Labour can start to deliver on its economic promises; but 0.1% GDP growth in the final quarter of last year is hardly the springboard she was hoping for. In the supportive message on X she sent on Monday as Keir Starmer’s future appeared under threat, the chancellor claimed “the conditions for the economy to grow are there”. But the latest data, published by the Office for National Statistics (ONS), suggests that despite six interest rate cuts from th"
  },
  {
    "title": "Jim Ratcliffe accused of hypocrisy after saying UK ‘colonised’ by immigrants",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/business/2026/feb/12/jim-ratcliffe-accused-hypocrisy-uk-colonised-immigrants",
    "published_at": "Thu, 12 Feb 2026 09:13:35 GMT",
    "compressed_text": "The Monaco-based billionaire Jim Ratcliffe has been accused of hypocrisy and using “far-right narratives”, as a backlash grew over his claims that the UK was being “colonised” by immigrants. Fans called the Manchester United co-owner’s comments “disgraceful and deeply divisive”, while Keir Starmer said his claim was “offensive and wrong”, and called on the Ineos chief executive to “apologise immediately”. The prime minister added: “Britain is a proud, tolerant and diverse country.”\n\nThe Greater "
  },
  {
    "title": "Pentagon reportedly gave Customs and Border Protection laser weapon that triggered El Paso airspace shutdown – as it happened",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/live/2026/feb/11/donald-trump-benjamin-netanyahu-israel-iran-jeffrey-epstein-jobs-economy-us-politics-live-news-updates",
    "published_at": "Thu, 12 Feb 2026 03:03:38 GMT",
    "compressed_text": "From 7h ago 03.03 GMT Closing summary This concludes our live coverage of the second Trump administration for the day, but we will be back at it on Thursday. Here are the latest developments: Donald Trump was presented with yet another award apparently invented just for him, when he received a trophy for being the “undisputed champion of beautiful, clean coal” from an industry executive. There is no such thing as clean coal. In what just seems like a plot from Veep, the Pentagon gave the people "
  },
  {
    "title": "Salesforce workers outraged after CEO makes joke about ICE watching them",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/2026/feb/11/salesforce-marc-benioff-ice-joke-employees",
    "published_at": "Thu, 12 Feb 2026 03:03:02 GMT",
    "compressed_text": "Marc Benioff, the Salesforce CEO and co-founder, is facing growing criticism over a joke he made about US Immigration and Customs Enforcement (ICE) monitoring international employees during an event for the company. Employees publicly expressed outrage about Benioff’s comments in his keynote address at an internal conference in Las Vegas on Tuesday, and leaders at Slack, which Salesforce owns, have said he should apologize. Benioff reportedly asked international employees to stand, before joking"
  },
  {
    "title": "Monks bring balm for America’s wounds as Washington cheers peace odyssey",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/2026/feb/11/buddhist-monks-peace-walk-washington-dc",
    "published_at": "Thu, 12 Feb 2026 01:37:40 GMT",
    "compressed_text": "Bhante Saranapala gazed down at more than a hundred Buddhist monks wearing burnt-orange, saffron and maroon robes, most sporting woolly hats, a few clutching flowers. “These monks are awesome!” roared Saranapala, who is known as the “Urban Buddhist Monk”, prompting a cheer from the big crowd. “Their determination should be greatly appreciated. Walking from Texas to Washington DC, 2,300 miles; it requires strong determination!”\n\nThe Lincoln Memorial has witnessed much over the past century – Blac"
  },
  {
    "title": "US officials lift 10-day closure of El Paso airspace after balloon mistaken for drone",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/2026/feb/11/faa-close-airspace-el-paso-texas-airport",
    "published_at": "Thu, 12 Feb 2026 01:23:55 GMT",
    "compressed_text": "The top US aviation agency has lifted a surprise 10-day closure of airspace above the US-Mexico border town of El Paso, Texas, just hours after it abruptly announced that it would close off the skies for “special security reasons”. While some officials claimed that Mexican cartel drones invaded US airspace, in recent days a balloon was reportedly mistaken for a drone. The initial, vague citation of security concerns prompted still more questions as conflicting narratives surrounding this surpris"
  },
  {
    "title": "Fundraiser for widow and children of James Van Der Beek surpasses $500,000 goal within hours",
    "source": "World news | The Guardian",
    "link": "https://www.theguardian.com/us-news/2026/feb/12/james-van-der-beek-fundraiser-wife-kimberly-children",
    "published_at": "Thu, 12 Feb 2026 00:40:44 GMT",
    "compressed_text": "A GoFundMe set up to support the widow and children of actor James Van Der Beek has passed its initial goal of $500,000 within hours of being created – and has now been updated to a goal of $1m. Van Der Beek, best known for his role as sensitive teen Dawson Leery on the TV series Dawson’s Creek, died on Tuesday aged 48 after a battle with bowel cancer. Van Der Beek is survived by his wife, Kimberly, and their six children, Olivia, Joshua, Annabel, Emilia, Gwendolyn and Jeremiah. Shortly after an"
  },
  {
    "title": "Voters flock to polling stations as Bangladesh holds landmark election",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/12/voters-flock-to-polling-stations-as-bangladesh-holds-landmark-election?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 10:18:38 +0000",
    "compressed_text": "NewsFeed Voters flock to polling stations as Bangladesh holds landmark election\n\nThe people of Bangladesh are voting in the first truly competitive election in 17 years, many casting their first ballots after years of autocratic rule. Al Jazeera’s Jonah Hull reports from Dhaka where young first-time voters say a parallel referendum and promised reforms could finally deliver a more democratic, hopeful future."
  },
  {
    "title": "Pam Bondi Epstein hearing: Key takeaways",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/pam-bondi-epstein-hearing-key-takeaways?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 10:07:05 +0000",
    "compressed_text": "Bondi clashed with Democrat representatives Jasmine Crockett and Ted Lieu during her Epstein files hearing. Over the span of five hours on Wednesday, United States lawmakers questioned Attorney General Pam Bondi over the US Justice Department’s (DOJ) handling of documents related to convicted late sex offender Jeffrey Epstein. Bondi, testifying before the House Judiciary Committee, defended the DOJ’s handling of the release of the Epstein records and said there are “pending investigations” in th"
  },
  {
    "title": "Canada police identify shooting suspect as 18-year-old Jesse Van Rootselaar",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/canada-police-identify-shooting-suspect-as-18-year-old-jesse-van-rootselaar?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 09:53:13 +0000",
    "compressed_text": "Police say the suspect had apprehended for a mental health assessment on more than one occasion. The suspect in a school mass shooting in Canada that killed eight people was an 18-year-old with a history of contact with police over her mental health, police have said. Canadian police identified the suspect on Wednesday as Jesse Van Rootselaar, saying she had died from a self-inflicted wound after carrying out the attack in the remote mountain community of Tumbler Ridge in British Columbia provin"
  },
  {
    "title": "Compromised peace? Oslo Accords figure deeply linked to Epstein network",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/features/2026/2/12/compromised-peace-oslo-accords-figure-deeply-linked-to-epstein-network?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 09:19:31 +0000",
    "compressed_text": "New documents reveal Terje Rod-Larsen facilitated visas for Jeffrey Epstein’s victims and was listed for a $10m payout, prompting Palestinians to question whether the peace process was engineered by blackmailed diplomats. The Norwegian diplomat who was a key architect of the 1993 Oslo Accords is facing a storm of corruption and blackmail allegations after new documents revealed he was deeply embedded in the inner circle of late sex offender and financier Jeffrey Epstein. Terje Rod-Larsen, a cent"
  },
  {
    "title": "Kosovo parliament backs Albin Kurti-led government ending deadlock",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/kosovos-parliament-approves-new-govt-ending-yearlong-political-deadlock?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 09:18:30 +0000",
    "compressed_text": "Securing international loans and reforming health and education systems among the top priorities of the new government. Kosovo’s parliament has approved a new government led by Prime Minister Albin Kurti after more than a year of political deadlock amid ongoing tensions with Serbia. Lawmakers in the 120-member assembly backed Kurti’s cabinet in a 66-49 vote on Wednesday, hours after parliament convened for the first time since his Vetevendosje party won a snap election in December. Before the vo"
  },
  {
    "title": "Virginia’s Law: How Democrat proposal could spark flood of sex abuse claims",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/virginias-law-how-democrat-proposal-could-spark-flood-of-sex-abuse-claims?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 09:17:01 +0000",
    "compressed_text": "US Democrats seek to scrap statute of limitations for sex abuse crimes in bill named after Epstein accuser Virginia Giuffre. Democrats in the United States Congress have proposed a new law which would fully scrap the statute of limitations for federal civil sex abuse cases. The proposed legislation has been named Virginia’s Law after Virginia Giuffre, who accused the late, convicted sex offender Jeffrey Epstein and his associates of sexually abusing and trafficking her in the 1990s when she was "
  },
  {
    "title": "Israeli forces demolish Palestinian homes in occupied West Bank",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/12/israeli-forces-demolish-palestinian-homes-in-occupied-west-bank-2?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 09:03:45 +0000",
    "compressed_text": "NewsFeed Israeli forces demolish Palestinian homes in occupied West Bank\n\nIsraeli forces demolished several Palestinian structures across the occupied West Bank, including homes, citing a lack of permits. Video shows soldiers assaulting and detaining residents during the operations."
  },
  {
    "title": "Argentinian security forces fire water cannon and tear gas at protesters",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/12/argentinian-security-forces-fire-water-cannon-and-tear-gas-at-protesters?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 08:59:37 +0000",
    "compressed_text": "NewsFeed Argentinian security forces fire water cannon and tear gas at protesters\n\nSecurity forces in Buenos Aires fired tear gas, rubber bullets and water cannon at protesters opposing proposed labour reforms. Unions say the bill would curb the right to strike and weaken worker protections. President Javier Milei argues it is key to his free-market agenda."
  },
  {
    "title": "Families mourn loved ones as they make emotional return to Gaza",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/12/families-mourn-loved-ones-as-they-make-emotional-return-to-gaza?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 08:55:24 +0000",
    "compressed_text": "Toggle Play\n\nFamilies mourn loved ones as they make emotional return to Gaza"
  },
  {
    "title": "Real Sociedad defeat Athletic Bilbao in Copa del Rey semifinal first leg",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/sports/2026/2/12/real-sociedad-defeat-athletic-bilbao-in-copa-del-rey-semifinal-first-leg?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 08:54:53 +0000",
    "compressed_text": "Real Sociedad inched towards a Copa del Rey final appearance with a first leg win against Athletic Club in semifinal. Real Sociedad took control of their Copa del Rey semifinal tie with ⁠a 1-0 first-leg ⁠win at Athletic Bilbao, as Benat Turrientes struck in the second half in the Basque derby on Wednesday. The clash between the longtime rivals ⁠was finely balanced in the first half, but the visitors were the more composed of the two sides and are well placed before the return leg ⁠at San Sebasti"
  },
  {
    "title": "Key candidates cast their ballots in Bangladesh elections",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/12/key-candidates-cast-their-ballots-in-bangladesh-elections?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 07:59:28 +0000",
    "compressed_text": "NewsFeed Key candidates cast their ballots in Bangladesh elections\n\nBangladesh’s leading political candidates have voted in a closely contested general election in Dhaka, pitting the Bangladesh Nationalist Party against a Jamaat-e-Islami-led coalition. It’s the country’s first election since the 2024 ousting of long‑time premier Sheikh Hasina in a Gen Z-led uprising."
  },
  {
    "title": "‘Colonial-era classism’: Residents decry demolitions in Nigeria’s Makoko",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/features/2026/2/12/colonial-era-classism-residents-decry-demolitions-in-nigerias-makoko?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 07:50:42 +0000",
    "compressed_text": "Lagos, Nigeria – Tunde Agando was paddling his way back to Makoko floating settlement in his canoe on a January afternoon, after taking his mother to the market, when he saw an amphibious excavator tearing down his family’s home. Before he could get close, the large home on stilts where he and 15 others lived in Lagos, Nigeria, had been brought down with all the possessions inside it – clothes, furniture, his brothers’ carpentry tools with which they built wooden canoes, and his plugged-in phone"
  },
  {
    "title": "Bangladesh goes to polls in crucial first election since deadly uprising",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/bangladesh-goes-to-polls-in-crucial-first-election-since-deadly-uprising?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 07:36:50 +0000",
    "compressed_text": "Bangladesh is voting in an election seen as pivotal for the nation’s future as it seeks to chart a democratic course in the wake of the 2024 ouster of longtime leader Sheikh Hasina in a student-led uprising that killed hundreds. Voters headed to the polls on Thursday to cast their votes in a contest pitting the Bangladesh Nationalist Party (BNP) and a Jamaat-e-Islami-led coalition that includes the National Citizens Party, formed by youth ‌activists instrumental in ousting Hasina. There are near"
  },
  {
    "title": "Iran’s Larijani accuses Israel of trying to sabotage US negotiations",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/irans-larijani-accuses-israel-of-trying-to-sabotage-us-negotiations?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 07:18:18 +0000",
    "compressed_text": "Tehran’s security chief says Israel is attempting to derail talks with Washington and provoke war in the region. Iran’s security chief Ali Larijani has accused Israel of attempting to sabotage negotiations with the United States over Tehran’s nuclear programme, so it can ignite a new war that would destabilise the region. In an interview with Al Jazeera Arabic during his visit to Doha, Qatar, where he met top officials on Wednesday, Larijani, secretary of Iran’s Supreme National Security Council"
  },
  {
    "title": "To Die for Palestine – Ep 2",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/video/al-jazeera-world/2026/2/12/to-die-for-palestine-ep-2?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 07:08:05 +0000",
    "compressed_text": "A Chadian chemist and a British activist, both born in Jerusalem, vow to fight for Palestine by any means necessary even if it costs them death. Two men devoted their lives to the Palestinian resistance but paid the ultimate price. Bashir Jibril, born in Jerusalem to a Chadian family, joined the Popular Front for the Liberation of Palestine (PFLP) after the 1967 Arab-Israeli war. He trained military cadres and took part in the 1970 airliner hijackings, before being killed in a car bomb explosion"
  },
  {
    "title": "North Korea’s Kim Jong Un sets stage for daughter as his successor: Seoul",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/north-koreas-kim-jong-un-sets-stage-for-daughter-as-his-successor-seoul?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 06:49:44 +0000",
    "compressed_text": "Little is known about Kim’s daughter, Ju Ae, who made her first public appearance in 2022 but appears set to be her father’s successor. South Korea’s spy agency believes that North Korean leader Kim Jong Un is preparing to designate his daughter, Kim Ju Ae, as his successor, increasing the agency’s earlier assessment of the teenager being the “most likely successor”. The National Intelligence Service in Seoul informed legislators of the news during a closed-door briefing on Thursday, according t"
  },
  {
    "title": "Children in Gaza forced to focus on work rather than school",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/features/2026/2/12/children-gaza-forced-focus-work-rather-school?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 06:23:26 +0000",
    "compressed_text": "Children in Gaza find themselves having to work to survive, sacrificing education and childhood dreams. Khan Younis, Gaza Strip – It is 5:30 in the morning. The sun hasn’t fully risen, but 15-year-old Mahmoud rubs the sleep from his eyes. He woke up this morning not in a warm bed, but on a thin mattress in a crowded tent – displaced, like hundreds of thousands of others in Gaza. And Mahmoud did not reach for a schoolbag to get ready for school."
  },
  {
    "title": "Epstein sought help of ex-Russian official linked to FSB, files show",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/economy/2026/2/12/epstein-sought-help-of-ex-russian-official-linked-to-fsb-files-show?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 05:10:05 +0000",
    "compressed_text": "Official with links to Russian spy agency collected information on woman to pass on to Epstein, emails show. Jeffrey Epstein used a former Russian official with links to Moscow’s FSB intelligence services to collect information on a woman he claimed was attempting to blackmail his business associates, according to documents released by the United States Department of Justice. Epstein reached out to Sergei Belyakov, a former deputy minister of economic development, for advice in 2015 about what h"
  },
  {
    "title": "Why was El Paso airspace shut down? Drones, security fears and confusion",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/why-was-el-paso-airspace-shut-down-drones-security-fears-and-confusion?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 05:03:15 +0000",
    "compressed_text": "The Federal Aviation Administration initially announced a 10-day airspace closure but removed the restriction less than eight hours later. A new United States military laser-based anti-drone system led authorities to halt air traffic in and out of El Paso, Texas, after aviation officials raised serious concerns about risks to commercial aircraft. The Federal Aviation Administration (FAA) initially announced a 10-day airspace closure on Wednesday but removed the restriction less than eight hours "
  },
  {
    "title": "Two children killed in drone strike on mosque in central Sudan: Doctors",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/three-children-killed-in-drone-strike-on-mosque-in-central-sudan-doctors?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 03:26:26 +0000",
    "compressed_text": "The Sudan Doctors Network said the deadly strike was carried out by the paramilitary Rapid Support Forces. A drone attack on a mosque in central Sudan has killed two children and injured 13 more, according to a Sudanese doctor’s association, amid a rise in similar attacks across the region. The Sudan Doctors Network said the attack was carried out at dawn on Wednesday by the Rapid Support Forces (RSF), a paramilitary group engaged in a three-year civil war with the Sudanese Armed Forces. The chi"
  },
  {
    "title": "Trump orders Pentagon to buy electricity generated by coal",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/economy/2026/2/12/trump-orders-pentagon-to-buy-electricity-generated-by-coal?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 03:06:51 +0000",
    "compressed_text": "Trump’s order is the latest move by US administration to boost fossil fuel industry despite climate change concerns. United States President Donald Trump has ordered the Pentagon to buy electricity generated by coal, his latest effort to boost demand for the fossil fuel amid its declining cost competitiveness and climate change concerns. In an executive order signed on Wednesday, Trump directed the US Department of Defence to enter into long-term purchase agreements with coal-fired plants and pr"
  },
  {
    "title": "Russia evacuates tourists from Cuba as US-engineered fuel crisis deepens",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/russia-to-evacuate-tourists-from-cuba-amid-us-engineered-fuel-crisis?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 02:20:22 +0000",
    "compressed_text": "Russia will operate only return flights from Cuba as ‘evacuation’ of Russian citizens visiting the Caribbean island gets under way. Russia is preparing to evacuate its citizens who are visiting Cuba, Moscow’s aviation authorities said, after a United States-imposed oil blockade on the island nation has choked off supplies of jet fuel. “Due to the difficulties with refuelling aircraft in Cuba, Rossiya Airlines and Nordwind Airlines have been forced to adjust their flight schedules to airports in "
  },
  {
    "title": "Breaking with Trump, US House votes to pass a bill ending Canada tariffs",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/breaking-with-trump-us-house-votes-to-pass-a-bill-ending-canada-tariffs?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 01:49:59 +0000",
    "compressed_text": "The vote was a rare rebuke against Trump from the Republican-led chamber, as Congress members face midterm elections. The United States House of Representatives has advanced a bill that would roll back President Donald Trump’s tariffs on Canada, a signal of growing willingness among Republicans to break with his administration. Wednesday’s vote saw several Republicans cross party lines to vote with Democrats. The final tally saw 219 votes in favour of ending Trump’s use of emergency powers to sl"
  },
  {
    "title": "US Energy Secretary Chris Wright touts oil production on Venezuela visit",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/us-energy-secretary-chris-wright-touts-oil-production-on-venezuela-visit?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 01:48:46 +0000",
    "compressed_text": "During Wright’s visit, Democrats introduced legislation to force Donald Trump’s administration to be transparent about its Venezuelan oil sales. United States Energy Secretary Chris Wright has visited Venezuela to meet with interim President Delcy Rodriguez, as his country pushes forward with plans for more foreign oil investment in the region. Wednesday’s meeting marked the first time a member of President Donald Trump’s cabinet has visited Venezuela. Overall, it was a rare instance of a high-l"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,449",
    "source": "Al Jazeera – Breaking News, World News and Video from Al Jazeera",
    "link": "https://www.aljazeera.com/news/2026/2/12/russia-ukraine-war-list-of-key-events-day-1449?traffic_source=rss",
    "published_at": "Thu, 12 Feb 2026 01:03:56 +0000",
    "compressed_text": "Russia-Ukraine war: List of key events, day 1,449\n\nThese are the key developments from day 1,449 of Russia’s war on Ukraine."
  }
]